feat(core/storage): add contacts structure
